CommandeCollectePublicationMesures/C4-CDC/request.xml

<?xml version="1.0" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tec="http://www.enedis.fr/sge/b2b/technique/v1.0" xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.enedis.fr/sge/b2b/commandercollectepublicationmesures/v3.0">
  <SOAP-ENV:Header>
    <tec:entete>
      <version>3.0</version>
      <infoDemandeur>
        <loginDemandeur>sge-tiers@votre-entreprise.fr</loginDemandeur>
      </infoDemandeur>
    </tec:entete>
  </SOAP-ENV:Header>
  <ns0:Body>
    <ns1:commanderCollectePublicationMesures>
      <demande>
        <donneesGenerales>
          <objetCode>AME</objetCode>
          <pointId>30001642617347</pointId>
          <initiateurLogin>sge-tiers@votre-entreprise.fr</initiateurLogin>
          <contratId>2617347</contratId>
        </donneesGenerales>
        <accesMesures>
          <dateDebut>2022-02-02</dateDebut>
          <dateFin>2023-02-02</dateFin>
          <declarationAccordClient>
            <accord>true</accord>
            <personneMorale>
              <denominationSociale>Mairie de Springfield</denominationSociale>
            </personneMorale>
          </declarationAccordClient>
          <mesuresTypeCode>CDC</mesuresTypeCode>
          <soutirage>true</soutirage>
          <injection>false</injection>
          <mesuresPas>PT10M</mesuresPas>
          <mesuresCorrigees>false</mesuresCorrigees>
          <transmissionRecurrente>true</transmissionRecurrente>
          <periodiciteTransmission>P1D</periodiciteTransmission>
        </accesMesures>
      </demande>
    </ns1:commanderCollectePublicationMesures>
  </ns0:Body>
</SOAP-ENV:Envelope>
